
var documents = [
    
        {
            "id": 0,
            "url": "/ja/404.html",
            "title": "404",
            "body": "404 Page not found!Please use the search bar from the bottom left or visit our homepage! "
            }, 
        
    
        {
            "id": 1,
            "url": "/ja/about",
            "title": "Seikiatsuについて",
            "body": "Seikiatsu is a play on the Japanese word 生活 (seikatsu) which means “living. ” This site is about Kia’s daily life and her thoughts about it. "
            }, 
        
    
        {
            "id": 2,
            "url": "/ja/authors",
            "title": "Authors",
            "body": "                                                                                                                                                                                    Kia:         Seikiatsuのキア。The Kia in Seikiatsu                "
            }, 
        
    
        {
            "id": 3,
            "url": "/ja/categories",
            "title": "Categories",
            "body": ""
            }, 
        
    
        {
            "id": 4,
            "url": "/ja/contact",
            "title": "Contact",
            "body": "  Please send your message to Seikiatsu. We will reply as soon as possible!   "
            }, 
        
    
        
        
    
        {
            "id": 5,
            "url": "/ja/",
            "title": "Home",
            "body": "                                                                                               鎌倉で癒しの旅に行った              :       忙しい東京生活から少し離れて鎌倉に行きました。:                                                                               Kia                 28 Jan 2022                                                                                                                           初めての書道体験              :       先週の土曜日に初めての書道を体験しました。:                                                                               Kia                 26 Jan 2022                                                                                                                           冬休みを長野で過ごした              :       休みを雪で過ごしたいため、長野に行きました。:                                                                               Kia                 31 Dec 2021                                "
            }, 
        
    
        
        
    
        
        
    
        
        
    
        
        
    
        
        
    
        
        
    
        {
            "id": 6,
            "url": "/ja/robots.txt",
            "title": "",
            "body": "      Sitemap: {{ “sitemap. xml”   absolute_url }}   "
            }, 
        
    
    
    {
        "id": 7,
        "url": "/ja/kamakura-enoshima/",
        "title": "鎌倉で癒しの旅に行った",
        "body": "2022/01/28 - 忙しい東京生活から少し離れて鎌倉に行きました。 1日目最近、やるべきこととやりたいことが重なっていて、頭の中が散らかってしまったため、あまり元気ではありません。ブレーキを踏まないと、燃え尽きるおそれがあります。それはいやなので、頭の中を整理したりリフレッシュしたりするため、有給休暇を取りました。 今回は、以前、一回行った事のある鎌倉に行きました。普段、私はできるだけ行ったことのない場所に行きたいですが結局鎌倉を選んだ理由は主に3つあります。一つ目は、私の家から鎌倉はあまり遠くないという事です。家から1時間くらいでいけます。この休みが割と突然だったので、お金をそれほど使いたくないため、交通費をできるだけ浮かしたかったです。2つ目は、鎌倉のイメージです。平和で、お寺が多くてスピリチュアルな場所で、私の現在の状況にぴったりだと思います。私は宗教的ではありませんが、自分の魂を浄化するという概念に興味を持っています。3つ目の理由は、海に近いからです。普段私は海をあまりみないから、海に行きたいと思っていました。 到着しました！今日は頭を休めたいため、イヤホンを使うのを控えました。 北鎌倉駅を出たらすぐに円覚寺というお寺があります。有料なので入らないで外から見ました。少し歩いて建長寺に向かいました。 標識に従って、次の途中降機である建長寺に向かって歩きました。  ハイキングコースの入口は建長寺の中にあるので中に入らないと行けません。これも拝観料が有料となります。建長寺はすごく広いです。でも平日だったため、人があまりいませんでした。   地図をたどって、この非常に長い通路に出くわしました。 そして、それは天国への門のように感じました。 私は鎌倉にこんなにたくさん洞窟があることを知りませんでした。 入場できるかどうかもわかりませんが、大好きなゲーム「トゥームレイダー」を思い出させてくれるのでワクワクします。 これらの興味深い彫像を見ました。 私は彼らが何であるかを知りませんが、翼を持っているので、彼らは私にキリスト教の天使を思い出させます。 西洋の宗教と日本の伝統が混ざったようなものです。グーグル先生と相談すると、あまりわからないけど天狗でした。  建長寺の中心の半僧坊の展望台に到着しました。 遠くまで見ると、実際に海が見えます。 寺院、森、丘、村、そして海が一望できるのが好きです。 すごいじゃないですか。  入り口が柵で少し塞がれているので、ハイキングコースは閉鎖されていると思いました。 ところが、ありがたいことに、お寺の人が案内してくれて、ハイキングコースの一部は行けますが、一部はがれきの落下で塞がれているとのことでした。途中までハイキングして、鎌倉駅に向かう予定でした。 ハイキングコースの登山口を登っているときに、突然富士山が見えました。雪で山頂部分が白く覆われていて、白い帽子をかぶっているようでした。 そして、今日の天気はあまり晴れていなかったので、浮かんでいるように見えます。見えてますか？ ハイキングをしている間、私にとってハイキングがとてもエキサイティングな理由をお話ししたいと思います。 私は小学生の頃からトゥームレイダーのゲームシリーズをプレイして育ちました。 そして、私は常に、そのゲームの主人公であるララ・クロフトと同じくらい強く、冒険的になりたいと思っていました。ゲームの主人公は主にハイキングやキャンプなどに出かけます 私はハイキングをしている人を見かけました。 そして、ハイキングをしている日本人は一般的に友好的であるため、私たちはお互いに挨拶を交わしました。 ここから富士山が見えるとのことでした。 そして、私はすでにそれを知っていました、しかし彼は私に彼が見ているところを見るように主張しました。 それで私は彼が立っていた場所に行きました、そして確かに、シーンはかなり良かったです。 富士山はこの石と完璧に調和しています。 この完璧なフレームをキャプチャすることができました。 私はこの小さな坂道をロープで通り過ぎました。 とても小さい道でしたが、少し冒険感があり、ワクワクしました。 もっと冒険感のある場所に行けたらいいなと思いました。 ハイキングしている素敵な夫婦を見かけました。 私は自分のナビゲーションを考えずに、ただリラックスしながら登山したかったので、二人についていくことにしました。二人を見て、年をとってもハイキングができるパートナーが欲しくなりました。 終盤に差し掛かり、いくつかの竹林がありました。 かなり短いハイキングコースを終えた後、トレイルの終わり近くにある覚園寺を訪れました。   鎌倉駅に向かって歩いていると、ロウバイと呼ばれる黄色い花が見えました。 私が持っていたガイドパンフレットによると、黄色い桜のように見えて、今が盛りです。 遅めの昼ごはん: お腹すきました。休日のご褒美として、「創作和料理近藤」という高評価の和食店に行きました。 これを食べたのですが、美味しかったです。 鎌倉を歩きながら撮った写真のいくつかを共有します。 春が近づいています！  彫像でさえマスクをかぶっています。 宿泊施設に向かって: ホステルに着きました。 そして、フレンドリーなホステルのオーナーのヒデさんと素晴らしいおしゃべりをしました。 彼は私にやるべきことや食事をするレストランについていくつかのアドバイスをしました。 彼は長谷寺に行くことを進めてくれました。私は既に今朝いくつかのお寺に行ったので、お寺に行くのを躊躇っていました。しかし、特に何もすることがなかったので、結局行くことにしました。 長谷寺: 到着して数分後、私の決断は間違っていないことを確信しました。 観音堂では、仏陀は普通の仏陀ではありません。観音は金色で巨大です。写真を撮りたかったのですが、残念ながら本堂内での写真撮影は禁止でした。  本堂横の堂にある阿弥陀像です。 本像ほど大きくはありませんが、それでも壮大です。 また、長谷寺の堂の1つを囲むこの小さな彫像にも興味をそそられました。地蔵と呼ばれています。ガイドによると、地蔵は子供を守り、子孫に繁栄をもたらす仏教の神です。 気がつきませんでしたが、この写真を友達に共有すると、「すごい、顔が全部違う」と言ってました。もう一回見ると、本当だと思いました。 寺院の敷地の頂上に到着し、見晴台に近づきました。 町と海が見えます。とても壮観でした。それを眺めながら、他に人がいなかったので、私は孤独を感じました。 梅の花が咲いているのを見ました。 日本庭園や神殿の敷地は、私をリラックスさせてくれました。私は一過性と不完全さを受け入れる日本の伝統的な美学の一種であるわびさびが好きです。それは、私の完璧主義を和らげ、完璧にする物事へのプレッシャーを和らげてくれます。私がこの庭を歩くと、私にかかっている圧力は解き放たれます。 当山の東に行き、鳥門を前にしてこの洞窟に進みました。中にはとても厳粛で、このとてもスピリチュアルな場所に畏敬の念を抱きました。中で祈っている人もいました。私が洞窟を出た直後に寺院は閉まりました。 夕食: 長谷寺を訪れた後、ほとんどすべてが閉まっていたので、しゃもじと呼ばれるヒデさんが勧める居酒屋に行くことにしました。 鎌倉は海のそばにあるので、当然シーフードが美味しいです。 三崎マグロの漬け丼、釜揚げトッピングの追加を注文しました。 三崎に行った時のことを思い出します。  思った通り魚は新鮮でした。 そして、ごはんで満腹になりました。 それで、ホテルに戻る前に散歩にしました。 気がつかなかったのですが、何も考えずに鎌倉駅に着くことができました。 今日はたくさん歩いて、夜遅くにホテルに到着したくなかったので、歩く代わりに、江ノ電鉄線で長谷駅に行くことにしました。 ホテルに着いた時には、私はかなり疲れていました。 しかし、私は本当に一日を満喫できたので、文句を言うことはありません。 2日目鎌倉は太陽が昇る東向きだと思っていたので、日の出を見たかったです。私は日の出のタイミングでハイキングと御来光を見にいくか、ビーチをランニングするか迷っていました。 しかし、昨夜は疲れていて、ハイキングコースを探す気力がなくなったので、ただ走りに行くことにしました。 午前5時30分ごろに起きました。ホステルから提供されたサービスコーヒーは、私に活力を与えました。 まだ暗いうちに外に出て、海辺を走り始めました。 私は波の音と新鮮な空気が大好きです。 美しい景色に気を取られて、真剣に走ることができませんでしいた。 私は時々ビデオや写真を撮るために立ち止まりました。その時撮った写真を皆さんに共有します。 最初に立ち寄ったのは稲村ヶ崎。 海のそばの岩に降りて、近くを眺めました。 波が岩に衝突したとき、轟音を立てていました。波が少し私に降りかかり、笑ってしまいました。 とても楽しく、そして、とても落ち着きました。 その時に感じる気持ちが大好きです。 江の島に向かって走っていると、ようやく太陽が出てきました。それを観察しながら写真を撮りました。オレンジ色の昇る太陽は青い海と対照的です。その光は海にも反射されていました。 「昇る太陽の国」にいるので、本当に日本にいるような気がしました笑。景色（走りも）は息を呑むほどで、美しい景色を見ることができてとても幸運でした。 ランニングで撮った写真です。  遠くから江の島。 走り続けて、ようやく江の島大橋にたどり着きました。実際の江の島に行くつもりはなかったのですが、もうここにいるので、ま、続けようと思いました。 江の島の入り口から江の島岩屋のある奥に向かって走りました。平日の早朝だったので、島はほとんど空っぽでした。 岩屋に通じるはっきりとした赤色の橋にたどり着きました。 でも、洞窟は午前9時まで開いていないので入場できませんでした。でも大丈夫、去年は2回も行きました笑。 最寄りの江ノ電の駅に向かって走り、ホステルに戻ってチェックアウトしました。 私は家に帰り始めました。 お腹が空いたので鎌倉駅にブランチに立ち寄りました。ガーデンハウスというカフェで食べました。さわやかな雰囲気が気に入りました。とてもお腹が空いたので、オープンサンドイッチにサラダを追加するように注文しました。 その後、東京に戻り始めました。東京に近づくにつれ、人だかりが増えました。ようやく電車を降りたときはかなり混んでいました。東京はとても人口の多い場所だということをしばらく忘れていました。都会の忙しさを思い出し、少し心を痛めました。利便性を犠牲にして、のんびりとした郊外や地方に住みたいです。 家に着くと、とても長い間旅行へ行っていたような気がしました。 一泊二日の休日を満喫したということだと思います。私は多くのことをしました。そして私は一人でした。 耳を澄ませて心の声を聞き、自分の考えに一人で向き合うことで、最近忙しくて気づけなかった本当の自分に気づくことができました。そうは言っても、私の非常に雑然とした脳は秩序を取り戻したと思います。ある意味、有給休暇を取るという目的を果たしました。 校正者：田中大樹 "
        }
        , 
        
    {
        "id": 8,
        "url": "/ja/first-shodo/",
        "title": "初めての書道体験",
        "body": "2022/01/26 - 先週の土曜日に初めての書道を体験しました。 私は書くことが好きですが、今までの人生で、本物の筆を持ったことがなかったので、このワークショップを楽しみにしていました。私も友達のヨシキさんもお正月っぽいことをしたかったのがきっかけでした。ヨシキさんが優しく誘ってくれて、二人をワークショップに参加できるようにオンラインで申し込んでくれました。 当日ワークショップの前に一緒にお昼を食べたかったから、早めに麻布十番駅で待ち合わせしました。お近くのカフェでランチを食べました。カフェのインテリアのセンスが良くて気に入りました。外食で抹茶ラテを飲んだので、家で飲んだ時よりも、より美味しく感じました。ヨシキさんとの話すのが相変わらず面白かったです。 少し歩いて、エナジーテラスSunnyGo!というワークショップの場所に着きました。私の住んでいるマンションと同じくらいの大きさの小さな地下室にあるアートギャラリーです。どんなに小さくても、インテリアの雰囲気はとてもカラフルであり、活気があります。色合いを比べると、さっき行ったカフェがくすんでしまいます。それは、主に書道家の鮮やかな作品の展示のおかげです。 書道家書道家さんは、葛谷綺仙と言います。綺仙さんは書道に熟練していて情熱をかけている人に見えます。綺仙さんは、IT企業で主な仕事をしている間も、時間を作って、書道をして過ごしていると言っていました。これは「副業」じゃなくて、「複業」だと説明してくれました。 私は綺仙さんのその話に深く感動しました。綺仙さんが自分が何をするのが大好きかを知っていて、実際にそれをやっていることは、私の心が刺激されました。 書道体験さっきも言ったように、書道の経験はありません。 当然、最初は緊張しました。 ありがたいことに、書道の道具や、筆を墨に浸す方法などの基本的なことを教えてくれました。 漢字を書き始めたときはとても気持ち良かったです。 半紙に漢字を描く感覚に心が惚れ込みました。初めてなので文字のバランスが崩れて、かなり見栄えが悪いと思います。その時、綺仙さんが私の文字を改善する方法を教えてくれました。 例として、覚えたのは「希望」の「望」の「月」の構成要素は、まっすぐではなく、湾曲している必要があるそうです。 初めてでしたが、私の脳のクリエイティブな部分は確実に刺激されました、創作することが大好きです。 特別なプレゼント綺仙さんはワークショップが終了する前に、私たちが申し込んだワークショップに綺仙さんからのプレゼントが含まれていることを思い出させました。そのプレゼントは、小さな色紙に綺仙さんが参加者をイメージして書いた漢字一文字です。綺仙さんがプレゼントの漢字を書いている時に、3人の参加者が周りに集まりました。最初は、私に対しての漢字を書きました。参加者たちは漢字が何であるかを推測してみました。そして、書き始めたら、参加者のみんなが器用さにとても驚いて、綺仙さんは称賛を浴びました。 私の漢字は「楽」でした。 私は自分の人生を楽しんでいるので、それは適切だと思います。 そして、最近は「楽」を感じたいので、まさにうってつけです。ヨシキさんの漢字は「繋」でした。なぜかというと、このイベントを開催する前に、ヨシキさんからの連絡がよく来たからだそうです。 書道家さんからのプレゼントを持って写真を撮りました。 綺仙さんの文字は美しいです。家に飾るのに楽しみにしています。 全体的に、書道のような日本文化を体験するのはとても楽しかったです。 書道家の綺仙さんはとても元気なので、周囲を明るくさせました。書道について多くのことを学び、将来は漢字をもっと書きたいと思っています。 校正者：田中大樹 "
        }
        , 
        
    {
        "id": 9,
        "url": "/ja/nagano-winter-trip/",
        "title": "冬休みを長野で過ごした",
        "body": "2021/12/31 - 休みを雪で過ごしたいため、長野に行きました。 前日: 前日準備できました！バッグが結構大きいのでカメラバッグも中に入れました。写真のとおり荷物の横にあるブーツは2年ぶりに使うからすごく楽しみにしています。 ということで、2年ぶりに雪が多い場所に行くから覚悟するために明日の天気予報を調べてみました。すごく寒いから少し緊張しています。 明日の出発は6時なのでアラームを5時に設定しておきました。 一日目出発です! まだ暗いですが一日を満喫するため早く到着しようと思っていました。 まずは参加者と上野駅の新幹線ホームで集合します。  電車で思ったこと  完全に忘れてましたが本日は平日なんです! 満員電車にびっくりしないはずなのに…。 上野駅から新幹線に乗った: 友達とやっと会えました。券売機で買いたかったのですが、私はモバイルSuicaを使っているので、suicaのカードを持っていません。結局、新幹線のみどりの窓口で買いました。  友達の紹介: 名前：ブライアン・ラオ ニックネーム：ブライ ブライは母校のアテネオのプログラミング授業の教師でした。彼が奈良先端科学技術大学院大学で大学院と博士課程を卒業しました。今年東京に引っ越して私と同じ種類の仕事のソフトウェアエンジニアとして働いています。 新幹線の雑談: フィリピンと日本の視野 二人はフィリピンに生まれ育って来日しました。フィリピンと日本の視野についてディスカッションしました。 カメラレンズの試しと説明 ブライがカメラガチなのでレンズをたくさん持っていて1個を私の基本のミラーレスのカメラに合わせて貸してくれました。その1個のレンズでカメラの機能を説明してくれました。 長野駅到着: 新幹線だとあっという間に長野に到着しました。東京より寒かったです。 杉玉について勉強になった: 朝食を食べる場所を探していてブライが私を呼び止めました。緑色の玉を指してそれが造り酒屋を現すと説明してくれました。 朝食@神戸屋キッチン: ホットサンドがセットで注文しました。旅行でも野菜を摂るのは欠かせないのでサラダがあってよかったです。 湯田中駅に向かう: バスか電車か選べましたが、私はバスが苦手なので、電車で行くことにしました。 駅でスイカ使えないことにびっくりしました。また券売機を使いました(☉｡☉)! 電車の床が濡れていることにも不思議だと思いました。やっぱり雪が多いと乗客の靴が濡れているんですね。 湯田中行の電車と乗り換えタイミングで以下の写真を撮りました。 景色は土地と山が雪で覆われていました。 ホステル到着: お部屋はシンプルな和室です。 外はこんな感じで和風をもっと感じました。 ランチ: ホステルの後ろにある中華そば屋さんでチャシューめんを食べました。たくさん歩くつもりなので高炭水化物は必要だと思いました。 満腹でした! 地獄谷野猿公苑: ランチ後は温泉に入っている猿さんたちの地獄谷野猿公苑という場所に向かいました。山道を歩きました。どこでも見たのは雪が積もっている真っ白な景色でした。すごくきれいでした。 厚い雪に積もった道も歩くことができました。新雪なので粉のように柔らかいです。あとは、以外と観光スポットなのに誰もいませんでした。 長く歩いて、やっと地獄谷野猿公苑に到着しました。 猿たちが温泉に入らないで周りに座ったり歩いたりしています。たぶん猿はいつも温泉にいるから飽きているかもしれません。 数分後についに猿が一匹入りました。観光客はみんな喜んでいました。 その上に、下記の写真のとおりに二匹の猿がやりました。ブライによると、この写真は「完璧な写真」だそうです（笑） 地獄谷野猿公苑からホステルまでまた歩こうとしました。ラーメンがもう消化されたのでお腹すいていました。運良くカフェを見つけました。カフェの照明が冬の景色と美しい対照をなすと思って写真を取ってみました。 ホットチョコレートを注文しました。冬といえばホットココアですね? ( ꈍᴗꈍ) 飲んだから寒い雪の山道を乗り切れるようになります! 湯田中温泉: 泊まっているホステルがよろづやという温泉と提携しているのでお得な割引を提供してくれました。その切符を購入してよろづやに向かいました。ホステルから歩いて5分で超便利ですね。  よろづやの上品で伝統的なインテリアが気に入りました。  露天風呂に入って積もった雪を見ました。残念ながら雪が降らなかったけど、雪景色の中で入るお風呂は最高でした。ほぼ一日中使っていた足が温泉の熱さのおかげでリラックスできて回復されました。疲れた後の温泉は最高ですね〜 ブライはこのくらい温泉で幸せでした。 居酒屋で夕食: 温泉から出たのはもう遅いのでほぼすべてのレストランがもう閉店していました。結局まだ開いている居酒屋に食べに行きました。 ブライアンはアルコールアレルギーで、私もアルコールの頻度を減らしたいので二人は居酒屋でソフトドリンク飲んじゃいました。オレンジジューズとサイダーで乾杯したのは面白いと思います。 焼き鳥食べました〜しょっぱすぎてオレンジジューズを注文したのはありがたいです(笑) 焼きおにぎりを食べたことないので食べました。なぜ茶色かわからなくて玄米だと思っていて超ヘルシーな居酒屋メニューだと思いました。ブライがそれは玄米じゃなくて醤油の効果だよって説明してくれました。間違えましたね(；^ω^） 二日目奥志賀高原スキー場: 湯田中駅から奥志賀高原までこのお得な赤いチケットでバスを乗りました。 雪の山が綺麗ですね〜これは東京から全然見えない景色なんです。 着いたらリフトのチケットを購入してスキーレンタルしました。  リフト乗りました。天気がよくてありがたいですヽ(･ˇ∀ˇ･ゞ) スキースクール、クラスとか受けてないのでスキーのやり方があまりわかりません。他のスキーヤーを見習いながらやってみました。 すごく怯えていましたがやってみたかったです。リフトを降りたらスキーでしか坂を降りられません。その恐怖を少し忘れるようにイヤホンを使いました。陽気な音楽を聴いたらとても恐怖心は和らぎました。音楽に励まされていてわくわくしながら坂を滑り降りました。 一方で、よく自信がなくなりました。転ぶのが怖くてパニックに陥っていました。パニックだから体が硬くなっちゃって結局転んでしまいました。転びすぎて何回転んだかがもう数えられないほど多いです。 初級の坂なのにこれほどへたくそなのは恥ずかしいですね(^～^;)ゞでも大丈夫ですよー。だれでも最初は初心者だからこの経験は当然です。だって、スキーをした理由はエンジョイするためですから。 とにかくすごく楽しかったです。転んでも雪がすごく柔らかくて全然大丈夫でした。 でも、知らないこととか、あまりなれていないことをやれば、頭が疲れますね? 言いたいのはスキーで脳の細胞が死んだように精神的に疲れました(~_~メ) 渋温泉へ: さきのバスチケットは往復なのでそれを使ってバスで山を降りました。 夕食: バス停から少し歩いてハッピーレストランに着きました。 うわ～やっと本物の食べ物なんです（朝食はヨーグルト、ランチはカロリーメイトしか食べなかったもの）！とんかつ定食が結構美味しかったです。 金具屋: 帰り道に渋温泉の金具屋に見に行きました。金具屋は歴史の宿です。スタジオジブリの千と千尋の神隠しのモデルだそうです。 渋温泉から歩いて帰りました。雪がもう半解凍されていたのですごく滑りやすかったです。気を付けて歩きました。 途中で、この雪で覆われているポストを見ました。私は雪とポストが両方好きで一枚の写真でこの素敵なシーンが撮れるのがいいですね〜さらに真赤なポストは真っ白な雪との対比が綺麗ですね〜 三日目ホステルをチェックアウトして、湯田中駅に向かいました。電車で長野駅に向かいました。時間を潰したいため本を読みました。 着いたらちょうどランチタイムでした。ブライが信州そば食べたかったので駅の立ち食いそば屋さんで月見そばを食べました。立ち食いははじめてでした (人 •͈ᴗ•͈) 予約したバスの時間になったらバス停に向かいました。なぜ帰るのがバスかの理由は節約したいからですが、休みはリラックスする時間のはずだから、それほど安っぽくしたくないと二人と決めました。往路が新幹線で復路がバスは満足できる妥協だと思いました。 バスを乗って本を読み続けました。 その後は、最後にこのレポートを書き終わらせました。全体的に、それはとても素敵な休暇でした。 今回の旅行は、私が雪の上を歩いた中で最も長い時間だと思います。 フィリピン人として熱帯の国で育ち、雪が降るのを見たことがなかったので、長野のような雪の降る場所に行くととても幸せです。 校正者：田中大樹 "
        }
        
    
];

var idx = lunr(function () {
    this.ref('id')
    this.field('title')
    this.field('body')

    documents.forEach(function (doc) {
        this.add(doc)
    }, this)
});
function lunr_search(term) {
    document.getElementById('lunrsearchresults').innerHTML = '<ul></ul>';
    if(term) {
        document.getElementById('lunrsearchresults').innerHTML = "<p>Search results for '" + term + "'</p>" + document.getElementById('lunrsearchresults').innerHTML;
        //put results on the screen.
        var results = idx.search(term);
        if(results.length>0){
            //console.log(idx.search(term));
            //if results
            for (var i = 0; i < results.length; i++) {
                // more statements
                var ref = results[i]['ref'];
                var url = documents[ref]['url'];
                var title = documents[ref]['title'];
                var body = documents[ref]['body'].substring(0,160)+'...';
                document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML + "<li class='lunrsearchresult'><a href='" + url + "'><span class='title'>" + title + "</span><span class='body'>"+ body +"</span><span class='url'>"+ url +"</span></a></li>";
            }
        } else {
            document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = "<li class='lunrsearchresult'>No results found...</li>";
        }
    }
    return false;
}

function lunr_search(term) {
    $('#lunrsearchresults').show( 400 );
    $( "body" ).addClass( "modal-open" );
    
    document.getElementById('lunrsearchresults').innerHTML = '<div id="resultsmodal" class="modal fade show d-block"  tabindex="-1" role="dialog" aria-labelledby="resultsmodal"> <div class="modal-dialog shadow" role="document"> <div class="modal-content"> <div class="modal-header" id="modtit"> <button type="button" class="close" id="btnx" data-dismiss="modal" aria-label="Close"> &times; </button> </div> <div class="modal-body"> <ul class="mb-0"> </ul>    </div> <div class="modal-footer"><button id="btnx" type="button" class="btn btn-primary btn-sm" data-dismiss="modal">Close</button></div></div> </div></div>';
    if(term) {
        document.getElementById('modtit').innerHTML = "<h5 class='modal-title'>Search results for '" + term + "'</h5>" + document.getElementById('modtit').innerHTML;
        //put results on the screen.
        var results = idx.search(term);
        if(results.length>0){
            //console.log(idx.search(term));
            //if results
            for (var i = 0; i < results.length; i++) {
                // more statements
                var ref = results[i]['ref'];
                var url = documents[ref]['url'];
                var title = documents[ref]['title'];
                var body = documents[ref]['body'].substring(0,160)+'...';
                document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML + "<li class='lunrsearchresult'><a href='" + url + "'><span class='title'>" + title + "</span><small><span class='body'>"+ body +"</span><span class='url'>"+ url +"</span></small></a></li>";
            }
        } else {
            document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = "<li class='lunrsearchresult'>Sorry, no results found. Close & try a different search!</li>";
        }
    }
    return false;
}
    
$(function() {
    $("#lunrsearchresults").on('click', '#btnx', function () {
        $('#lunrsearchresults').hide( 5 );
        $( "body" ).removeClass( "modal-open" );
    });
});