
var documents = [
    
        {
            "id": 0,
            "url": "/ja/404.html",
            "title": "404",
            "body": "404 Page not found!Please use the search bar from the bottom left or visit our homepage! "
            }, 
        
    
        {
            "id": 1,
            "url": "/ja/about",
            "title": "pages.about",
            "body": "せきあつは、日本語「生活」の言葉遊びです。 このサイトは、キアの日常生活とそれについてのキアの考えについてです。 "
            }, 
        
    
        {
            "id": 2,
            "url": "/ja/authors",
            "title": "authors",
            "body": "                                                                                                                                                                                    Kia:         Seikiatsuのキア。The Kia in Seikiatsu                "
            }, 
        
    
        {
            "id": 3,
            "url": "/ja/categories",
            "title": "pages.categories",
            "body": ""
            }, 
        
    
        {
            "id": 4,
            "url": "/ja/contact",
            "title": "pages.contact",
            "body": "  Seikiatsuにメッセージを送ってください。 できるだけ早く返信します！   "
            }, 
        
    
        
        
    
        {
            "id": 5,
            "url": "/ja/",
            "title": "pages.home",
            "body": "                                                                                               多摩湖サイクリングロード              :       友人のマルちゃんと花見ハイキングに行きたかった。しかし、春にはまだ早いので、代わりにサイクリングに誘うことにした。一石二鳥だと思ったのです。私のほとんどないサイクリング技術の練習にもなるし、マルちゃんと一緒に過ごすこともできます。:                                                                               Kia                 12 Mar 2022                                                                                                                           幕山で女子ハイキング              :       幕山で女子ハイキングしました！:                                                                               Kia                 26 Feb 2022                                                                                                                           鎌倉で癒しの旅に行った              :       忙しい東京生活から少し離れて鎌倉に行きました。:                                                                               Kia                 28 Jan 2022                                                                                                                           初めての書道体験              :       先週の土曜日に初めての書道を体験しました。:                                                                               Kia                 26 Jan 2022                                                                                                                           冬休みを長野で過ごした              :       休みを雪で過ごしたいため、長野に行きました。:                                                                               Kia                 31 Dec 2021                                "
            }, 
        
    
        
        
    
        
        
    
        
        
    
        
        
    
        
        
    
        
        
    
        
        
    
        
        
    
        
        
    
        {
            "id": 6,
            "url": "/ja/robots.txt",
            "title": "",
            "body": "      Sitemap: {{ “sitemap. xml”   absolute_url }}   "
            }, 
        
    
    
    {
        "id": 7,
        "url": "/ja/cycling-lake-tama/",
        "title": "多摩湖サイクリングロード",
        "body": "2022/03/12 - 友人のマルちゃんと花見ハイキングに行きたかった。しかし、春にはまだ早いので、代わりにサイクリングに誘うことにした。一石二鳥だと思ったのです。私のほとんどないサイクリング技術の練習にもなるし、マルちゃんと一緒に過ごすこともできます。 ※友人の名前はマルではないのですが、本人の希望で変更しました。 準備この旅行の発端は私なので、大まかな計画を立てることになった。私は計画を立てるのが好きだし、マルちゃんも比較的オープンな性格のようなので、全然気にしてないんですけどね。 多摩川沿いを走っているときに知った多摩川（1）サイクリングコースを検討しました。この時点で週に4回くらい多摩川沿いを走っているので、違うところに行きたかったのと、桜がまだ咲いていないところが長いので、ここは誰かと一緒にサイクリングしたほうがいいと思ったからだ。そこで、東京近郊で行けそうなサイクリングロードをグーグルしてみました。江戸川、荒川など、サイクリングに人気な場所は出てきた。しかし、目に留まったのは多摩湖サイクリングロードだった。Googleの説明で、「都心からあまり離れずに自然を楽しむのに最適 」というようなことが書かれていたのが売りだった。 私もマルちゃんも自転車を持っていないのですが、どうせいつもレンタルしているのだからと安心していました。しかし、いつも使っているレンタサイクルのアプリ「ドコモ・バイクシェア」を調べてみると、多摩湖の近くにはレンタルステーションがないことが判明したのです。そこで、レンタサイクルの方法を調べなければ、今回の旅行には行けなかった。 幸いなことに、ハローサイクリングというレンタルサービスも主流になっています。ドコモより規模が大きいようです。早速ダウンロードし、サイクリングを始める駅である武蔵境駅にいくつか自転車ステーションがあることを確認。マルちゃんにインストールするように言うと、クーポンコードを聞かれた。どうやら、自分も友達も誘うと割引になるプロモが実施されているようだ。なるほどと思った。こうして、私たちは旅に出るための装備を整えた。 マルちゃんに最寄りの駅を聞いたら、駅名と駅番号を答えてくれたのには驚きました。私はほとんど駅番号を使ったことがないので、面白いと思いました。彼の出身地を考慮し、サイクリングのスタート地点である武蔵境駅に向かう途中で待ち合わせができる駅を探した。そして、大まかなタイムテーブルを作成し、注意事項を添えて、前日にマルちゃんに送った。 当日家を出る前に、日本語の先生と電話をして、スピーキングの練習をしました。毎週土曜日に練習をしているのですが、この日はかなり早い時間からスケジュールを組んでくれたので、ラッキーでした。食事をする気にもなれず、カフェインで元気を出そうとカフェラテを飲んだ。 待ち合わせ場所の御茶ノ水駅には、時間通りに到着した。マルちゃんは遅れそうだとのこと。私は、それを全く気にしなかった。しかし、昔からそうだったわけではない。若い頃、私は遅刻者を待つことが大嫌いだった。待っている人に失礼だし、時間の無駄だと思ったからだ。ありがたいことに、私の人生観が変わるとともに、遅刻者を待つことに対する反応や態度も変わりました。今では、どうしようもないことにネガティブな反応をするのは無意味だと思うようになりました。遅刻した人を責めることも無意味です。事故は起こるものだから、遅刻した人が悪いとは限らない。遅刻した人が時間を守ろうと努力しても、たまたま電車に乗り遅れるなど不運な場合もあります。※(1) 物事の無意味さと事故が起こるという事実を認めた上で、私は待つ時間を無駄にする必要はないとも考えました。遅刻を完全に回避することはできないので、今では待ち時間をスマホをいじるなどして自分を楽しませることに使っています。今回は、Kindleリーダーを持っていたので、今読んでいる村上春樹の「走ることについて語るときに僕の語ること」を読むのに使いました。 待っている間に、2回目のカフェインを摂取した。エネルギーの「ブースター」を得て、覚醒した。駅のコンビニのボトルコーヒーなのに、割と美味しかった。いい買い物をした。 マルちゃんと駅のホームで待ち合わせ、次の目的地行きの電車に乗った。カフェインのおかげで目が覚め、かなり饒舌になりました。久石譲の音楽がいかに優れているかという話になった。彼は「千と千尋の神隠し」のテーマが好きで、私は「ナウシカ」が好きだ。キャッチーなのが一番の理由。曲名は覚えていないけど、聞けばわかるんです。 しばらくして、武蔵境駅に到着。改札を出てすぐのスーパーマーケット「クイーンズ伊勢丹」でピクニック用の食料を買いました。レジの人がマルちゃんに「おしぼりはいかがですか」と聞いたのですが、マルちゃんはわからなかったので、私が「はい」と答えて、後で意味を説明しました。こういう言葉は授業で習うものではなく、経験で身につけるものなんだろうなと思いました。買ったサンドイッチをバッグに入れるとき、バッグに入れたミカンのことを思い出した。乗っている間に絞られるのが怖くて、後で「万が一、オレンジジュースになったらどうしよう」と冗談を言いながら。スーパーの包装カウンターにあるビニール袋に入れるようにマルちゃんに言われたので、そうしました。 ハローサイクリングの駅まで歩いたのは、「ウォーミングアップのため」と私はマルちゃんに言いました。でも本当の目的は、サイクリングロードにできるだけ近いところでサイクリングを始めたかったからです。そう、その通り、サイクリングロードのスタート地点に行くには、少し自転車を漕がなければならなかったのだ。 歩きながら、マルちゃんにCold Heartという曲の話をしました。今、私の耳に残っている曲で、デュア・リパとエルトン・ジョンの両方が歌っている曲だということが、とにかく魅力的だった。そう、昔のエルトン・ジョンです。マルちゃんがエルトン・ジョンを知っていることに感激した。若い人でクラシックを知っている人は少ないですからね。マルちゃんはセンスがいいなぁと思いました。 散歩の途中、きれいな花も見られました。ここでマルちゃんが「もう東京を出たような気がする」と言ったのですが、私も大賛成です。まだ東京なのに、もう郊外にいるような感じでした。私はこの環境が気に入りました。天気は完全に協力で、雲一つ見えません。 ハローサイクリングの駅に到着し、自転車を受け取りました。必要なものではないのですが、どれもほぼ同じものでした。私はマルちゃんにそれがどのように行われるかを説明しました。実を言うと、ハローサイクリングを利用するのは初めてだ。でも、ドコモは使ったことがあるから、手順も同じだろうと思ったのだ。そして、そうだった。 自転車のロックを解除しました。背の低い私はサドルを調整する必要があり、マルちゃんが手伝ってくれた。シートの高さを調節するのでさえ、助けが必要なのだ。さらに、パーキングストッパー※(2)を押し上げて駐輪を解除しようとしたが、動かない。マルの説明によると、バイクの左側にレバーがあり、それを押してからでないとパーキングストッパー※(2)を上げることができないそうです。だから、歩くときは自転車の左側を歩かなければならないのだ、と。また一つ、基本的なことを学びました。ありがとう、マルちゃん。 走り始めて、とても緊張しました。今月何度か行ったサイクリング練習のおかげで、以前よりは緊張しなくなりましたが、それでも緊張の度合いは高かったです。落ち着きを取り戻すために、トゥルーワイヤレスイヤホンで音楽を聴くことにしました。マルちゃんに聞いてみると、「いいよ、うるさくないなら」と。まあ、片方のイヤホンしか使わないから関係ないんだけどね。この光景を見て、私はスキーに行った時のことを思い出した。スキーは技術不足でコントロールが効かないので怖いのだ。イヤホンを装着し、高揚感のある音楽を聴くと、恐怖心は事実上50％程度に軽減され、ゲレンデを滑ることができました。運悪く、イヤホンが落下してしまい、その不安解消も束の間。今回はイヤホンが落ちないことを祈る。Cold Heartをかけ、音楽が与えてくれる安らぎに感謝した。 ハローサイクリングの自転車は、ドコモの自転車より軽く感じました。マルちゃんからは、メンテナンスが行き届いているとの指摘を受けましたが、私が以前借りた自転車よりもスムーズで大正解でした。今までハローサイクリングを利用しなかったのは、知らなかったからということになります。マルちゃんにもいい初体験ができたようでよかったです。　 サイクリングロードのスタート地点に着くまでに、実際の道路を何本か自転車で走りました。緊張するけれども、スタート地点にたどり着くにはそれしかないし、勉強にもなる。恐怖に立ち向かわなければ、学ぶことはできない、そう自分に言い聞かせた。マルちゃんには、私の下手な技術を理解してくれるよう、何度もお願いしましたが、私の下手な技術を理解してくれて、とても親切にしてくれたので、やりすぎだったかもしれません。マルちゃん、ありがとうございました。 あちこちの道路を横断して、ようやくスタート地点にたどり着きました。車には狭いが、自転車には十分すぎるほどだ。 実際に自転車用のミニロードがあり、かわいいな、と思いました。 車線は2つあり、1つは前進、もう1つは後進である。ランナー、ジョガー、ウォーカーなど、たくさんの人がこの道路を利用していました。 道路は共有の場所なので、そんなにスピードは出せません。私はまだ不器用なライダーであることを事実として知っていたので、特に気をつけなければならなかった。自分のコントロール能力のなさで、誰かにぶつかってしまうのが一番嫌だった。自分が怪我をすることよりも、誰かにぶつかってしまうことのほうが怖かったんだ。スタートが非常に遅かったのは、私の特別な用心深さと自信のなさ、そしてこの日記の中でさらに述べることになるのだが、ライディングの後になってわかったもう一つの理由のせいだった。 道路には、自転車を減速させるための金属製の障壁、つまり「障害物」と呼ぶべきものがたくさんあった。障害物というのは、自転車の速度を落とすのに効果的なもので、私に対しては格別に効果がある。一般的なサイクリストは、この障害物を簡単に通過することができますが、私はその逆です。自信のない私は、このような小さなスペースに自分を押し込めることは大変な努力でした。狭いところを走るのが怖い（ぶつかるのが怖い）ので、9割方、自転車から降りて歩いて通り抜けました。マルならこれらの障害を難なく通過できたと思いますが、彼は私の後ろを自転車で走り、私が止まらなければならない時に止まるという忍耐強さを持っていました。 障害物があると、直進するのが面倒で嫌になるんです。地図上では見えないので、まったく予想がつかなかったのです（笑）。でも、歩行者の安全を守るために必要なものなので、仕方ないと思っています。文句を言おうと思えばいくらでも言えるのですが、魔法のように消えるわけではないので、そのままにしておきました。とはいえ、この機会に、これらの障害が自分に不利になるのではなく、実際に自分に役立つことがあることを知りました。止まって、降りて、歩いて、また乗るという動作を繰り返すことで、無意識のうちにその技術を練習していることに気づいたんです。短い時間で止まったり、乗ったりすることに慣れたんです。プラスもマイナスも、結局はすべて勉強になるんです。学ぶことが悪いことであるはずがないことだけは確かだ。 数キロのサイクリングの後、このサイクリング活動の最初の節目となる駅を通り過ぎた。他の駅と同じように、この駅にもいくつかのレストランやお店が点在していた。この時、トイレに行けなかったので、スーパーマーケットにあるトイレを借りた。マルちゃんにも言ったのだが、「まだ我慢できる」と引き下がった。私は、マルちゃんの足手まといになっているのだから、トイレは後日、予定されている休憩時間にすればいいと思っていたのだ。でも、マルちゃんが我慢しちゃダメだと言うので、了承しました。スーパーを出てすぐのところに駐輪禁止の看板があったのですが、マルは私の自転車の面倒を見るために残るつもりだったので、外で待っていました。私は出来るだけ早くと思いましたが、あいにくいつものようにお手洗いは行列でした。マルちゃんのところに戻ると、ほっとしました。我慢することが、その時の精神的なストレスにもなっていたとは、ついてきてよかったです。 さらに走行を続けると、自転車と歩行者用のとても急な陸橋に出くわしました。それは私を大きく威圧した。これを書いている時点では、正確に覚えていませんが(3)、マルちゃんが「坂道の乗り方を学ぶチャンスだ」と言ってくれたような気がします。自転車のアシストの調整方法を指導してくれました。アシストを強めにしたら、陸橋をそれほど苦労せずに乗り越えられて、すごいと思いました。下りるのは自信がなかったので、ブレーキを使いながらゆっくり下りました。 さらに障害物に遭遇しながら、自転車で前進した。時には自信満々で通過することもありましたが、ほとんどの場合、ぶつかりそうになってしまうのです。私はマルに、「プライドを捨てて（障害物を）通らなければならない」と言った。 数分後、私たちは小さな公園に寄って一休みすることにした。冬が終わろうとしているだけに、公園はかなり枯れているように見えた。私は糖分を補給するためにみかんを食べた。カップルかどうか分からない二人の通行人を見ながら、年を取ることについておしゃべりをした。 湖が見えたら次の目的地と決め、自転車を走らせる。途中、白人の家族が通りかかりました（これが後々関係してきます）。 マルちゃんが自転車のギアについて説明。変えてみてくださいと言われた。そのとたん、自転車の効率が格段に上がるのを感じた。後で考えたら、この教えのきっかけは、私が1速で無駄にペダルを踏んで苦労しているのを見たからだろう。文句を言うどころか、むしろ感謝している。 自転車で変速するのは運転と同じだと、マニュアル運転の記憶を思い出しながら思ったのです。そこから、自転車に乗ることを運転と関連付けるようになりました。下を向かずに前を見る、ゆっくりブレーキをかける、適切に変速する、などなど。結局、自転車はミニマルなクルマに過ぎないと、私は思っているのです。このような考えと合図で、緊張の一部は取り除かれました。 続いて… さらに別の関門で立ち止まると、マルちゃんが「あいつを転ばせたのか」と叫んだ。私は気がつかなかったし、何も見なかったし、聞かなかった。でも、実際にそうだったとしても不思議はない。その人が誰であっても、私はかわいそうだと思った。 さらに数回障害物を乗り越えて、ようやく5分に1、2回遭遇する程度に減ってきた。サイクリングロードを利用する人たちについても、同じことが言える。さて、これが私のサイクリング体験の画期的な変化でした。湖のすぐそばにある公園の入り口に、僕とまるは予想よりもずっと早く到着した。前半の半分くらいの時間で到着。信じられない思いで地図を再確認しましたが、本当でした。 ここまでの後半は、障害物が少ないだけでなく、少し自信がついてきたこともあり、ただひたすら進むというコントロールができるようになったため、かなり速く走ることができました。ケイティ・ペリーが「花火」で歌ったように、ハリケーンの後には虹がかかる。 ここまで13kmも走ってきたんだから、そりゃあ花火も上がるわな。しかも、ほんの1～2ヶ月前までは、100m程度の距離もパニックにならずに自転車に乗れなかった人間が。 記念にポーズをとって自撮りしました。 というのも、まだ体力が残っていたので（たぶんマルちゃんも）、「停められるときに停める」、つまりバイクを停められる場所があれば、そこで休憩を取ろうということになったのです。マルちゃんは、「止まりたくなったらいつでも止まっていいよ」と言ってくれて、とても親切にしてくれました。 サイクリングは後半と同じように順調に進みました。しかし、標高が以前よりずっと変化しているので、少し違和感がある。 家族連れが遊んでいる公園が見えたので、そこに寄ることにしました。自転車は公園用のパーキングに停めました。何しろ借りたばかりなので、自転車が盗まれないか心配でした。でも、ロックしてみたら、驚くほどできたんです。あとは、ピンでロックを解除すれば、いつでも出発できるのです。 長い間乗っていた自転車から降りると、ほっとします。持ってきた水分補給が足りないことに気づいたのもこの時で、パーキング横の自動販売機でもう1本購入しました。都心から離れていても、自動販売機で喉の渇きを癒すことができるのは嬉しい。日本は本当に自動販売機の国なのだ。 少し歩いて公園の中にある見晴らし台へ。やっと屋根の下に入れたので、気持ちよかったです。日焼けのし過ぎに気づかなかった。確かマルも日陰で休みたがっていた。見晴台は空いていた。 見晴台のすぐそばに充電ポートがあるのを見たまる。私たちはとても驚きました。日本は自動販売機の国であるだけでなく、「便利な国」なのです。私はここで携帯電話を充電しました。 座って、駅から持ってきたサンドイッチを食べました。スマホも体も充電できて万々歳。 お弁当を食べた後、公園を散策しました。一本だけ咲いている木を見かけたので、もちろんそこで自撮りしました。 公園のあちこちに落ち葉がたくさん積まれているのを観察しました。その落ち葉を見ると、アサシンクリードを思い出すので、ジャンプして落ちたい衝動に駆られます（知ってる人は知ってますよね）。しかし、アサシンクリードはあくまでゲームであり、現実の物理法則からすると、私はきっと怪我をしてしまうだろう。 この公園には、いくつかの障害物コースがありました。もし私がフル充電していたら、全部挑戦していたかもしれませんが、まだゴールまで距離があったので、体力を温存することにしました。しかし、その中のひとつに興味を引かれ、丸太登りをしました。マルさんのご好意で、その様子を録画していただきました。楽しかったです。まるで自分が悪者のトゥームレイダーになったような気分になりました（彼女がやっていることに比べたら全然たいしたことないですが笑）。 この公園での休憩は、身体だけでなく、精神的な充電にもなった。この挑戦で、すでに精神的に疲れていることをマルさんに告げた。と言ったら、「精神的にきつい状態を長く続けられるのはすごいことだ」と言われ、光栄に思いました。 駐車場に戻ると、ありがたいことにレンタルバイクがまだあった。鍵を開けて、サイクリングを続ける。しかし、この休憩のおかげで、徐々に自信がついてきたのか、スピードが出るようになりました。 走行中、ときどき左手首がしびれるようになった。精神的なストレスが原因だろうと自分では思っていた。精神的なストレスとはいえ、それが肉体的なストレスに反映され、自転車のハンドルを強く握りすぎて腕や手がこわばってしまったのです。それに気づいたら、積極的に握りを少し緩めるようにしました。 そんなこんなで自転車を走らせていると、先ほどの白人一家が見えてきた。もう帰るところだった。うわー、まだ途中なのに、この家族、子供連れで、もう帰っちゃうんだ。それだけでなく、私を簡単に追い抜いていく小さな子供たちもいました。私も彼らに負けないような走りをしたいものです。 コントロールが効かなくなりそうで怖い時もあった。そして、「I’m losing control」という歌詞を持つランダムなプレイリストからイヤホンで流れている曲は、まったく役に立ちませんでした。コントロールが効かなくなり、クラッシュするのが怖かったのです。でも、ストイックにやればいいんだ……と自分に言い聞かせ、死に抗うことは死を近づけるだけだと思った。 コントロール不能と感じない時は、特に滑っている時は、実は気持ち良かったのです。そして、自転車に乗ったまま、足をペダルにくっつけたまま、坂道を降りることが、やっとめちゃくちゃ怖くなくなったことに気がつきました。今までできなかったことなので、小さな達成感でちょっと誇らしい気持ちになりました。 もう疲れていたので、現在地から一番近いハローサイクリングステーションで乗り納めすることにしました。そのステーションは、仏教寺院のそばにありました。自転車を降りた瞬間、私は大きな安堵感を覚えました。歩くことは、精神的な緊張を必要とせず、コントロールする必要もなく、自分が自分の体であるために転ぶこともありえないという事実のため、驚くほど気持ちがよかった。もしかしたら、自転車に乗っている人は、自転車が自分の体の一部のように感じていて、完全にコントロールできているように感じるのかもしれない？ せっかく来たのだから、お寺も見ていこう。境内を歩いていると、真っ赤なパゴダと洞窟が見えてきました。冒険心で、マルを誘って洞窟の中に入ってみた。洞窟の中は風が吹いていて涼しく、長時間の運動の後だったので、とても爽やかな気分でした。洞窟を出て、パゴダの裏側へ。 私たちは、面白い建築物のある階段を下りていくのを見ました。子供のころに行ったバギオの中国寺院を思い出しました。 小さな池に延々と水を流している観音像がありました。また、たくさんの風車に囲まれたお寺も見かけました。大学時代、元彼から毎年風船をもらっていたことを思い出しました。いい思い出なので、そのことをマルちゃんに話しました。 さっき近くのパーキングを調べていたら、実は今いる場所の近くに「トトロの森」があることがわかったんです。それを見てみたいと思っていたところ、幸いにもマルちゃんがOKしてくれた。ナビをさせてもらった。ドラゴンに守られた階段を登り返すと、すでに頂上で方向が違うことに気がついた。結局、下へ戻ることになったのがおかしかった。 途中、地図でこのリングを見かけ、とても気になりました。 近くを歩いてみると、実はドーナツの穴は神社で、ドーナツ自体は円形の池を囲んでいて、その周りには植物も生えている。面白いな、と思った。 歩いて進むと、日本語で「お参りありがとうございました」と書かれた看板がありました。知っておいて損はないと思い、マルに説明した。 誰もいない道を散策していると、ランナーズハイと同じような恍惚とした気分になった。もしかしたら、かなり長い時間自転車を漕いだので、エンドルフィンが出ているのかもしれないと思った。 巨大なドームが見えてきた。 私はマルとStravaについて話し始めた。基本的に「運動するためのFacebook」である、と私は言った。また、3月に100キロのサイクリングをして、乗り方を覚えて、ある程度自信が持てるようになりたいという目標も明かした。 ファミリーマートの前を通り、水分補給を購入。今まで必要な水分補給を甘く見ていたことに気づき、爽健美茶の大瓶を手に入れました。汗で水分が失われたので、水分補給のためにたくさん飲んだ。 Google Mapで確認すると、もう埼玉にいることがわかった。その事実に感激して、マルちゃんに宣言した。しかし、彼はすでに知っていた。どうやら、サイクリング中に埼玉に入るという看板を見たらしい。私はサイクリング中にコントロールすることに集中しすぎて、その標識に全く気がつかなかった。 トトロの森に到着。Googleで調べると、夏のハイキングで人気の場所らしい。トトロの森1、トトロの森2、などと番号が振られたスポットがいくつかあった。よくわからなかった。 トトロの森へのトラバースは、予想外のハイキングだった。マルちゃんのパンツは動きにくそうでした。ごめんね、マルちゃん、と思った。この場を借りて、以前、事務服で行った鎌倉での想定外のハイキングの話をしました。 歩いたり登ったりして小休止を取り、私は爽健美茶を飲みました。爽やかで、健やかで、美しいお茶です」と、マルちゃんに漢字で説明しました。 また、マルには森林浴の概念を説明しました。漢字を教えたら、木の成分がたくさん出てきて面白かったです。 森を歩いていると、だんだん虫が多くなってきました。冬が終わったばかりで、まだそんなに暖かくなかったので、変だなあと思いました。歩いていると看板があり、「虫たちの森」と書いてありました。なるほどと思いました。 トトロの数々の森の中を歩いていると、トランペットの音が聞こえてくるようになりました。森林浴を彩る、ゆったりとした良いBGMでした。 別の地図で見たところ、近くに梅林があるはずだった。私が行ったことのある東京・神奈川エリアでは、すでに梅があちこちで咲いていたので、きっと咲いているのだろうと思っていました。梅の木があると思われる場所まで歩いたのですが、実は見た地図をメモしていなかったため、梅の木を見ることができませんでした…。 マルちゃんは枯れ木に気づき、その木はもうピークを過ぎていると言った。枯れ木はまだ咲いておらず、ピークを過ぎたのは緑の木々だから、それは違うよと教えてあげました。 梅林は見つからなかったので、狭山湖のすぐそばにある公園の方に向かった。歩いていると、トランペットの音が大きくなってきて、近づいていることを実感する。湖のふもとに到着。湖が見えるように小高い丘に登らなければならない。登っている途中、丘の上にいるトランペット奏者を見たマルちゃんは、「ついに来たか！」と叫んだ。私も同じことを思った。 ようやく見えた湖は巨大で、息をのむような美しさだった。湖の景色だけでなく、湖の反対側を向いた景色も素晴らしかったです。 マルさんは、視界に入ったサッカー場を見て、「日本では野球場の方が人気だから、珍しいね」と言った。 湖畔には延々と滑走路が続いていて、マルちゃんは「万里の長城に来たみたいだ」と言った。二人とも行ったことないんですけどね。万里の長城の存在すら忘れていた。 休憩所まで歩き、お菓子を食べる。マルちゃんはファミチキを2つ買って、1つを私に分けてくれたようだ。ジューシーな骨なしフライドチキンをかじりながら、この美味しいお菓子を食べるのは久しぶりだと思いました。 マルちゃんは勉強の話を、私はチキンを食べながら彼の話を聞いていました。 そろそろ疲れが出てきたので、駅に戻ることにしました。最寄り駅は西武球場前。こんなに広い駅なのに、とても空いていました。目的の列車が到着したので、座席を確保する。座席はクッションが効いていて、かなりふにゃふにゃしている。長い間、自転車に乗っていてお尻が痛くなっていたマルにはありがたい。 電車が動き出し、いよいよ帰途につく。一番長く自転車で走ったのはいつですか？と聞くと、この旅が一番長いと答えた。私もだ。 帰路の途中、すでに日が暮れていた。きれいな景色だなあと、私は感嘆の声を上げた。マルちゃんは、「私は小さなことに感謝することができる」と言いました。私はその言葉を聞いて、その通りだと思いました。毎日、日記を書いているから、小さなことにも感謝できるようになったのだと思います。 夕焼けは、一日の終わりと旅の終わりを意味しているのだと思いました。郊外への旅はとても素敵なものでした。また絶対に行きたいと思った。マルちゃんに言いたかったけど、停車駅が近くなったら言えばいいやと躊躇していた。でも、マルちゃんが先に言ってくれたので、嬉しくて言い返しました。 乗り換えが必要なところまで来たので、マルちゃんに別れを告げ、感謝の気持ちを伝えました。 さらに電車を乗り継ぎ、いくつかの駅を経て、私は家に帰ることができました。荷を解いて、最後のみかんを見ました。よかった、ジュースにならなくて、と思いました。 備考(1) とはいえ、遅刻する人には理解を示しつつも、時間を守るように努力することを強く勧めるのは、結局は自分の責任だからです。 (2) これが何というものかわからず、自転車部品でググっても解決しなかった (3) ある出来事について日記を書くのは、その直後にするのがベストです。それ以上長くなると、細かいことを忘れてしまうからです。 謝辞マル、お付き合いいただき、ありがとうございました。とても楽しい経験でした。 Dua Lipa &amp; Elton John、Cold Heartという曲をありがとうございました。あなたの素晴らしい音楽のおかげで、自転車から落ちる恐怖から来るストレスから解放されました。 ハローサイクリング、自転車がなくてもサイクリングに行けるようにしてくれてありがとうございました。 "
        }
        , 
        
    {
        "id": 8,
        "url": "/ja/makuyama/",
        "title": "幕山で女子ハイキング",
        "body": "2022/02/26 - 幕山で女子ハイキングしました！ きっかけ毎月少なくとも一回ハイキングをしたいため、2月の上旬でグーグル先生におすすめの登山を聞いてみました。グーグル検索結果の中に、花見ができるハイキング記事を見かけたので、花見をしたい気がしました。そのため、「ハイキング」、「日帰り」、「初心者」のいつもの使っているグーグル検索キーワードに「花見」を追加して、検索しました。結果の一覧で一番上はこの記事です。 黄色にピンク色とりどり。低山お花見ハイクで、一足早く春の花を愛でに行こう！ 記事を読んで、花が綺麗だなと思いました。お気に入りの色はピンクなので、選択肢は桜、桃、梅になりました。桜と桃はまだ開花の時期ではないと思うので、梅を見に行くことにしました。記事の中には、最も早い梅の開花時期は湯河原の幕山であるのでそこを選択しました。2月上旬～3月中旬頃が書いてあるのでちょうど良かったと思いました。最初は、12日に予定を立てましたが別の予定と重なったので翌週に変更したが、雨だったので、結局26日にしました。 参加者今回は、二人の友達を誘いました。ちょっとだけ紹介しようと思います。 ライ: ライはマレーシア出身で、仕事の同期です。日本で一番親しい友達の一人です。ハイキングしたい時には、よくライを誘っていました。私のハイキング歴がもっとも多いのはライでした。 ヒナ: ヒナは私が最初に仲良くなった日本人の一人です。先月一緒にバドミントンをやってて、ヒナと運動したのは楽しかったので誘いました。ハイキングが好きらしいです。 私は主催者で、二人をお互いに紹介するのは私の責任です。日本語で人を紹介する単語を知らなかったので、出発前の言語交換で日本人に尋ねると、「幹事」という言葉が使えるそうです。つまりは、このハイキング予定で、私は幹事となりました。 この自撮りを途上で撮りました。 ハイキングする前、一日の段取りの下書きを書いて、こういう風に二人に送りました。  ざっくりと明日の計画してみた  7:45上野東京ラインで川崎駅から出発  7:45-9 湯河原駅へ  9~ コンビニ、トイレなど  9:30 バスで幕山公園へ  10 ハイキングをゆっくりでスタート  12 ハイキングコース途中ピクニック  14 ハイキング終了 川崎駅から出発予定通りに、川崎駅で待ち合わせました。 全参加者が集まったら、お互いに紹介してあげました。二人は日本語と英語しゃべれるので平気だと思いました。言語の壁がなさそうです。 上野東京ラインを乗って、出発しましました。 途中で色々なことについてしゃべったりして、三人の波長が悪くないと思います。 富士山に向かっているので大きく見ました。 線路が海に沿ってますので綺麗に見えました。 湯河原駅に到着 予定通りに駅前のコンビニでピクニック用の食べ物を買いました。お腹がすいたのでバスを乗る前に皆がおにぎりを1個食べました。 グーグルマップを見ると、幕山へ向かうにはバスを利用するとのことです。グーグルで調べたダイヤが実際に少し異なっていました。わかったのは湯河原駅前のバス停で、おねえさんが幕山行きのバスの出発を大声でアナウンスしていたことです。たぶん「梅の宴」というイベントが開催中なので、特別なダイヤもあるかもしれません。 バスに乗っている間に「重要な質問を忘れたけど、花粉症をじゃないよね」と友達に確認しましたが、計画を立てる前に聞いておけばよかったです。今度もっといい主催者になるように、こういう細かいことを意識します。幸運なことに、ライもヒナも花粉症ではないそうです。 バスの中で最近大人気のWordleという英語の単語ゲームをヒナに紹介しました。ライと私は、すでに毎日Wordleでお互いの試行錯誤したプレイの履歴を交換しているので、彼女に紹介する必要はありません。ヒナさんは英語に興味あり、楽しめると思うのでこのゲームを紹介しました。ゲームのルールを説明した上で、ヒナが当日、ゲームの中で言葉を推測し始めました。興味のある方は、是非このリンクでやってください。 Wordle - A daily word game ハイキングバスが幕山公園に到着しました。入園料を支払う必要があるので、3人が列に並んで、入園券を購入しました。入口には今花どれほど咲いているかが書いてある看板があります。まだ満開ではなく、残念だと思いました。でも、この旅がもう2回延期になってしまったことを思い出して、七分咲きでも、十分ラッキーだと思います。2週間前に行ったら、たぶんまだ何も咲いていなかったかもしれません。  公園に入ったら、ピンクの梅の花が囲まれた景色を見ました。イベントが開催中なので、人が思ったより多かったです。出店ブースが並んでいます。残念ながら、食べ物がもうコンビニから買ったので出店で買いませんでした。 山麓に近づいて、ハイキングを始めました。梅林が綺麗だと思いました。歩き始めて数分後、梅の花の甘い香りがしました。いい香りでした。「うわー！いい香りがするね！」とライとヒナに確認しましたが、二人はにおいが何もしなかったそうです。 歩き続けると、温かい日差しのため、動いている身体が温められました。確かに、冬の終わりなので、今からだんだん暖かくなります。衣類を着すぎたと思ってシャツまで一枚ずつ脱いでました。 地図を見ないで、順路に従いました。進めば進むほど梅の木の数が減少しました。おかしいと思ったので、ハイキングアプリで地図を確認しました。「しまった、輪のハイキングコースを反時計回りのはずなのに、時計回りに歩いてしまいました。」友達に謝って、この方向に進むのが大丈夫かどうかを確認しました。二人は大丈夫そうなので、そのまま進みました。 この小さな祠が森林の入り口にあります。 クスノキの純林に入りました。 先述したように、今日は暖かかったので木陰にいるのは涼しくて、気持ちよかったです。 ハイキングしながら、ヒナは「あ、Wordleの言葉の推測ある」と嬉しそうに叫びました。面白いと思いました。 山を登り続けて、道が泥土になりました。滑って危なかったです。仕方がないので、気を付けて歩きました。なぜこの道が泥だらけなのか、理由わかりようになりました。山を登るにつれて、土の上に、薄い氷の斑紋を見かけた。確かに、数日前、この山をインスタで検索、雪が積もったそうです。 やっと、山頂に着きました。ピクニックしている人が多かったです。私たちもピクニックしました。用意したピクニックマットを草の上に広げて、コンビニの食べ物を楽しみました。泥だらけの道のおかげで、靴とズボンが汚いことに気づきました。 食べている間に、ヒナはやっと本日のWordleを解決できました。 食べた後、山頂から相模湾を眺望しました。素敵な景色だと思います。 山を降り始めました。当然ですが、降りるのほうが体力が登りほどいらないので、楽でした。 巨大な岩を見ました。ロッククライミングできる岩なんです。見るだけでわくわくしました。残念ながら、準備できなかったので、体験できませんでした。険心をくすぐられることに興味があるためもし機会があれば、今度絶対やります。 少し歩いて、ようやく梅林に着きました。花がすごく多くて、ピンクの森林の感じでした。持っていたカメラでたくさん写真を撮りました。何枚を共有させていただきます。   たくさんの花のがあるため、香りだすごくしました。ヒナはやっと香りがしたそうです。こんな甘い香りは自然の楽園だと思います。ライは最後まで梅の香りがしなかったようで、私たちはとても笑いました。 帰り帰るのは同じく東京上野ラインを乗りました。少し疲れたので帰り道はあまりしゃべらないで、無口でした。 全体的に今回のハイキングが女らしいと言えます。山があまり高くないし、コースも優しかったし、景色がピンク色で、女子会にぴったりだと思います。ライとヒナをお互い紹介したのは楽しかったです。 校正者：田中大樹 "
        }
        , 
        
    {
        "id": 9,
        "url": "/ja/kamakura-enoshima/",
        "title": "鎌倉で癒しの旅に行った",
        "body": "2022/01/28 - 忙しい東京生活から少し離れて鎌倉に行きました。 1日目最近、やるべきこととやりたいことが重なっていて、頭の中が散らかってしまったため、あまり元気ではありません。ブレーキを踏まないと、燃え尽きるおそれがあります。それはいやなので、頭の中を整理したりリフレッシュしたりするため、有給休暇を取りました。 今回は、以前、一回行った事のある鎌倉に行きました。普段、私はできるだけ行ったことのない場所に行きたいですが結局鎌倉を選んだ理由は主に3つあります。一つ目は、私の家から鎌倉はあまり遠くないという事です。家から1時間くらいでいけます。この休みが割と突然だったので、お金をそれほど使いたくないため、交通費をできるだけ浮かしたかったです。2つ目は、鎌倉のイメージです。平和で、お寺が多くてスピリチュアルな場所で、私の現在の状況にぴったりだと思います。私は宗教的ではありませんが、自分の魂を浄化するという概念に興味を持っています。3つ目の理由は、海に近いからです。普段私は海をあまりみないから、海に行きたいと思っていました。 到着しました！今日は頭を休めたいため、イヤホンを使うのを控えました。 北鎌倉駅を出たらすぐに円覚寺というお寺があります。有料なので入らないで外から見ました。少し歩いて建長寺に向かいました。 標識に従って、次の途中降機である建長寺に向かって歩きました。  ハイキングコースの入口は建長寺の中にあるので中に入らないと行けません。これも拝観料が有料となります。建長寺はすごく広いです。でも平日だったため、人があまりいませんでした。   地図をたどって、この非常に長い通路に出くわしました。 そして、それは天国への門のように感じました。 私は鎌倉にこんなにたくさん洞窟があることを知りませんでした。 入場できるかどうかもわかりませんが、大好きなゲーム「トゥームレイダー」を思い出させてくれるのでワクワクします。 これらの興味深い彫像を見ました。 私は彼らが何であるかを知りませんが、翼を持っているので、彼らは私にキリスト教の天使を思い出させます。 西洋の宗教と日本の伝統が混ざったようなものです。グーグル先生と相談すると、あまりわからないけど天狗でした。  建長寺の中心の半僧坊の展望台に到着しました。 遠くまで見ると、実際に海が見えます。 寺院、森、丘、村、そして海が一望できるのが好きです。 すごいじゃないですか。  入り口が柵で少し塞がれているので、ハイキングコースは閉鎖されていると思いました。 ところが、ありがたいことに、お寺の人が案内してくれて、ハイキングコースの一部は行けますが、一部はがれきの落下で塞がれているとのことでした。途中までハイキングして、鎌倉駅に向かう予定でした。 ハイキングコースの登山口を登っているときに、突然富士山が見えました。雪で山頂部分が白く覆われていて、白い帽子をかぶっているようでした。 そして、今日の天気はあまり晴れていなかったので、浮かんでいるように見えます。見えてますか？ ハイキングをしている間、私にとってハイキングがとてもエキサイティングな理由をお話ししたいと思います。 私は小学生の頃からトゥームレイダーのゲームシリーズをプレイして育ちました。 そして、私は常に、そのゲームの主人公であるララ・クロフトと同じくらい強く、冒険的になりたいと思っていました。ゲームの主人公は主にハイキングやキャンプなどに出かけます 私はハイキングをしている人を見かけました。 そして、ハイキングをしている日本人は一般的に友好的であるため、私たちはお互いに挨拶を交わしました。 ここから富士山が見えるとのことでした。 そして、私はすでにそれを知っていました、しかし彼は私に彼が見ているところを見るように主張しました。 それで私は彼が立っていた場所に行きました、そして確かに、シーンはかなり良かったです。 富士山はこの石と完璧に調和しています。 この完璧なフレームをキャプチャすることができました。 私はこの小さな坂道をロープで通り過ぎました。 とても小さい道でしたが、少し冒険感があり、ワクワクしました。 もっと冒険感のある場所に行けたらいいなと思いました。 ハイキングしている素敵な夫婦を見かけました。 私は自分のナビゲーションを考えずに、ただリラックスしながら登山したかったので、二人についていくことにしました。二人を見て、年をとってもハイキングができるパートナーが欲しくなりました。 終盤に差し掛かり、いくつかの竹林がありました。 かなり短いハイキングコースを終えた後、トレイルの終わり近くにある覚園寺を訪れました。   鎌倉駅に向かって歩いていると、ロウバイと呼ばれる黄色い花が見えました。 私が持っていたガイドパンフレットによると、黄色い桜のように見えて、今が盛りです。 遅めの昼ごはん: お腹すきました。休日のご褒美として、「創作和料理近藤」という高評価の和食店に行きました。 これを食べたのですが、美味しかったです。 鎌倉を歩きながら撮った写真のいくつかを共有します。 春が近づいています！  彫像でさえマスクをかぶっています。 宿泊施設に向かって: ホステルに着きました。 そして、フレンドリーなホステルのオーナーのヒデさんと素晴らしいおしゃべりをしました。 彼は私にやるべきことや食事をするレストランについていくつかのアドバイスをしました。 彼は長谷寺に行くことを進めてくれました。私は既に今朝いくつかのお寺に行ったので、お寺に行くのを躊躇っていました。しかし、特に何もすることがなかったので、結局行くことにしました。 長谷寺: 到着して数分後、私の決断は間違っていないことを確信しました。 観音堂では、仏陀は普通の仏陀ではありません。観音は金色で巨大です。写真を撮りたかったのですが、残念ながら本堂内での写真撮影は禁止でした。  本堂横の堂にある阿弥陀像です。 本像ほど大きくはありませんが、それでも壮大です。 また、長谷寺の堂の1つを囲むこの小さな彫像にも興味をそそられました。地蔵と呼ばれています。ガイドによると、地蔵は子供を守り、子孫に繁栄をもたらす仏教の神です。 気がつきませんでしたが、この写真を友達に共有すると、「すごい、顔が全部違う」と言ってました。もう一回見ると、本当だと思いました。 寺院の敷地の頂上に到着し、見晴台に近づきました。 町と海が見えます。とても壮観でした。それを眺めながら、他に人がいなかったので、私は孤独を感じました。 梅の花が咲いているのを見ました。 日本庭園や神殿の敷地は、私をリラックスさせてくれました。私は一過性と不完全さを受け入れる日本の伝統的な美学の一種であるわびさびが好きです。それは、私の完璧主義を和らげ、完璧にする物事へのプレッシャーを和らげてくれます。私がこの庭を歩くと、私にかかっている圧力は解き放たれます。 当山の東に行き、鳥門を前にしてこの洞窟に進みました。中にはとても厳粛で、このとてもスピリチュアルな場所に畏敬の念を抱きました。中で祈っている人もいました。私が洞窟を出た直後に寺院は閉まりました。 夕食: 長谷寺を訪れた後、ほとんどすべてが閉まっていたので、しゃもじと呼ばれるヒデさんが勧める居酒屋に行くことにしました。 鎌倉は海のそばにあるので、当然シーフードが美味しいです。 三崎マグロの漬け丼、釜揚げトッピングの追加を注文しました。 三崎に行った時のことを思い出します。  思った通り魚は新鮮でした。 そして、ごはんで満腹になりました。 それで、ホテルに戻る前に散歩にしました。 気がつかなかったのですが、何も考えずに鎌倉駅に着くことができました。 今日はたくさん歩いて、夜遅くにホテルに到着したくなかったので、歩く代わりに、江ノ電鉄線で長谷駅に行くことにしました。 ホテルに着いた時には、私はかなり疲れていました。 しかし、私は本当に一日を満喫できたので、文句を言うことはありません。 2日目鎌倉は太陽が昇る東向きだと思っていたので、日の出を見たかったです。私は日の出のタイミングでハイキングと御来光を見にいくか、ビーチをランニングするか迷っていました。 しかし、昨夜は疲れていて、ハイキングコースを探す気力がなくなったので、ただ走りに行くことにしました。 午前5時30分ごろに起きました。ホステルから提供されたサービスコーヒーは、私に活力を与えました。 まだ暗いうちに外に出て、海辺を走り始めました。 私は波の音と新鮮な空気が大好きです。 美しい景色に気を取られて、真剣に走ることができませんでしいた。 私は時々ビデオや写真を撮るために立ち止まりました。その時撮った写真を皆さんに共有します。 最初に立ち寄ったのは稲村ヶ崎。 海のそばの岩に降りて、近くを眺めました。 波が岩に衝突したとき、轟音を立てていました。波が少し私に降りかかり、笑ってしまいました。 とても楽しく、そして、とても落ち着きました。 その時に感じる気持ちが大好きです。 江の島に向かって走っていると、ようやく太陽が出てきました。それを観察しながら写真を撮りました。オレンジ色の昇る太陽は青い海と対照的です。その光は海にも反射されていました。 「昇る太陽の国」にいるので、本当に日本にいるような気がしました笑。景色（走りも）は息を呑むほどで、美しい景色を見ることができてとても幸運でした。 ランニングで撮った写真です。  遠くから江の島。 走り続けて、ようやく江の島大橋にたどり着きました。実際の江の島に行くつもりはなかったのですが、もうここにいるので、ま、続けようと思いました。 江の島の入り口から江の島岩屋のある奥に向かって走りました。平日の早朝だったので、島はほとんど空っぽでした。 岩屋に通じるはっきりとした赤色の橋にたどり着きました。 でも、洞窟は午前9時まで開いていないので入場できませんでした。でも大丈夫、去年は2回も行きました笑。 最寄りの江ノ電の駅に向かって走り、ホステルに戻ってチェックアウトしました。 私は家に帰り始めました。 お腹が空いたので鎌倉駅にブランチに立ち寄りました。ガーデンハウスというカフェで食べました。さわやかな雰囲気が気に入りました。とてもお腹が空いたので、オープンサンドイッチにサラダを追加するように注文しました。 その後、東京に戻り始めました。東京に近づくにつれ、人だかりが増えました。ようやく電車を降りたときはかなり混んでいました。東京はとても人口の多い場所だということをしばらく忘れていました。都会の忙しさを思い出し、少し心を痛めました。利便性を犠牲にして、のんびりとした郊外や地方に住みたいです。 家に着くと、とても長い間旅行へ行っていたような気がしました。 一泊二日の休日を満喫したということだと思います。私は多くのことをしました。そして私は一人でした。 耳を澄ませて心の声を聞き、自分の考えに一人で向き合うことで、最近忙しくて気づけなかった本当の自分に気づくことができました。そうは言っても、私の非常に雑然とした脳は秩序を取り戻したと思います。ある意味、有給休暇を取るという目的を果たしました。 校正者：田中大樹 "
        }
        , 
        
    {
        "id": 10,
        "url": "/ja/first-shodo/",
        "title": "初めての書道体験",
        "body": "2022/01/26 - 先週の土曜日に初めての書道を体験しました。 私は書くことが好きですが、今までの人生で、本物の筆を持ったことがなかったので、このワークショップを楽しみにしていました。私も友達のヨシキさんもお正月っぽいことをしたかったのがきっかけでした。ヨシキさんが優しく誘ってくれて、二人をワークショップに参加できるようにオンラインで申し込んでくれました。 当日ワークショップの前に一緒にお昼を食べたかったから、早めに麻布十番駅で待ち合わせしました。お近くのカフェでランチを食べました。カフェのインテリアのセンスが良くて気に入りました。外食で抹茶ラテを飲んだので、家で飲んだ時よりも、より美味しく感じました。ヨシキさんとの話すのが相変わらず面白かったです。 少し歩いて、エナジーテラスSunnyGo!というワークショップの場所に着きました。私の住んでいるマンションと同じくらいの大きさの小さな地下室にあるアートギャラリーです。どんなに小さくても、インテリアの雰囲気はとてもカラフルであり、活気があります。色合いを比べると、さっき行ったカフェがくすんでしまいます。それは、主に書道家の鮮やかな作品の展示のおかげです。 書道家書道家さんは、葛谷綺仙と言います。綺仙さんは書道に熟練していて情熱をかけている人に見えます。綺仙さんは、IT企業で主な仕事をしている間も、時間を作って、書道をして過ごしていると言っていました。これは「副業」じゃなくて、「複業」だと説明してくれました。 私は綺仙さんのその話に深く感動しました。綺仙さんが自分が何をするのが大好きかを知っていて、実際にそれをやっていることは、私の心が刺激されました。 書道体験さっきも言ったように、書道の経験はありません。 当然、最初は緊張しました。 ありがたいことに、書道の道具や、筆を墨に浸す方法などの基本的なことを教えてくれました。 漢字を書き始めたときはとても気持ち良かったです。 半紙に漢字を描く感覚に心が惚れ込みました。初めてなので文字のバランスが崩れて、かなり見栄えが悪いと思います。その時、綺仙さんが私の文字を改善する方法を教えてくれました。 例として、覚えたのは「希望」の「望」の「月」の構成要素は、まっすぐではなく、湾曲している必要があるそうです。 初めてでしたが、私の脳のクリエイティブな部分は確実に刺激されました、創作することが大好きです。 特別なプレゼント綺仙さんはワークショップが終了する前に、私たちが申し込んだワークショップに綺仙さんからのプレゼントが含まれていることを思い出させました。そのプレゼントは、小さな色紙に綺仙さんが参加者をイメージして書いた漢字一文字です。綺仙さんがプレゼントの漢字を書いている時に、3人の参加者が周りに集まりました。最初は、私に対しての漢字を書きました。参加者たちは漢字が何であるかを推測してみました。そして、書き始めたら、参加者のみんなが器用さにとても驚いて、綺仙さんは称賛を浴びました。 私の漢字は「楽」でした。 私は自分の人生を楽しんでいるので、それは適切だと思います。 そして、最近は「楽」を感じたいので、まさにうってつけです。ヨシキさんの漢字は「繋」でした。なぜかというと、このイベントを開催する前に、ヨシキさんからの連絡がよく来たからだそうです。 書道家さんからのプレゼントを持って写真を撮りました。 綺仙さんの文字は美しいです。家に飾るのに楽しみにしています。 全体的に、書道のような日本文化を体験するのはとても楽しかったです。 書道家の綺仙さんはとても元気なので、周囲を明るくさせました。書道について多くのことを学び、将来は漢字をもっと書きたいと思っています。 校正者：田中大樹 "
        }
        , 
        
    {
        "id": 11,
        "url": "/ja/nagano-winter-trip/",
        "title": "冬休みを長野で過ごした",
        "body": "2021/12/31 - 休みを雪で過ごしたいため、長野に行きました。 前日: 前日準備できました！バッグが結構大きいのでカメラバッグも中に入れました。写真のとおり荷物の横にあるブーツは2年ぶりに使うからすごく楽しみにしています。 ということで、2年ぶりに雪が多い場所に行くから覚悟するために明日の天気予報を調べてみました。すごく寒いから少し緊張しています。 明日の出発は6時なのでアラームを5時に設定しておきました。 一日目出発です! まだ暗いですが一日を満喫するため早く到着しようと思っていました。 まずは参加者と上野駅の新幹線ホームで集合します。  電車で思ったこと  完全に忘れてましたが本日は平日なんです! 満員電車にびっくりしないはずなのに…。 上野駅から新幹線に乗った: 友達とやっと会えました。券売機で買いたかったのですが、私はモバイルSuicaを使っているので、suicaのカードを持っていません。結局、新幹線のみどりの窓口で買いました。  友達の紹介: 名前：ブライアン・ラオ ニックネーム：ブライ ブライは母校のアテネオのプログラミング授業の教師でした。彼が奈良先端科学技術大学院大学で大学院と博士課程を卒業しました。今年東京に引っ越して私と同じ種類の仕事のソフトウェアエンジニアとして働いています。 新幹線の雑談: フィリピンと日本の視野 二人はフィリピンに生まれ育って来日しました。フィリピンと日本の視野についてディスカッションしました。 カメラレンズの試しと説明 ブライがカメラガチなのでレンズをたくさん持っていて1個を私の基本のミラーレスのカメラに合わせて貸してくれました。その1個のレンズでカメラの機能を説明してくれました。 長野駅到着: 新幹線だとあっという間に長野に到着しました。東京より寒かったです。 杉玉について勉強になった: 朝食を食べる場所を探していてブライが私を呼び止めました。緑色の玉を指してそれが造り酒屋を現すと説明してくれました。 朝食@神戸屋キッチン: ホットサンドがセットで注文しました。旅行でも野菜を摂るのは欠かせないのでサラダがあってよかったです。 湯田中駅に向かう: バスか電車か選べましたが、私はバスが苦手なので、電車で行くことにしました。 駅でスイカ使えないことにびっくりしました。また券売機を使いました(☉｡☉)! 電車の床が濡れていることにも不思議だと思いました。やっぱり雪が多いと乗客の靴が濡れているんですね。 湯田中行の電車と乗り換えタイミングで以下の写真を撮りました。 景色は土地と山が雪で覆われていました。 ホステル到着: お部屋はシンプルな和室です。 外はこんな感じで和風をもっと感じました。 ランチ: ホステルの後ろにある中華そば屋さんでチャシューめんを食べました。たくさん歩くつもりなので高炭水化物は必要だと思いました。 満腹でした! 地獄谷野猿公苑: ランチ後は温泉に入っている猿さんたちの地獄谷野猿公苑という場所に向かいました。山道を歩きました。どこでも見たのは雪が積もっている真っ白な景色でした。すごくきれいでした。 厚い雪に積もった道も歩くことができました。新雪なので粉のように柔らかいです。あとは、以外と観光スポットなのに誰もいませんでした。 長く歩いて、やっと地獄谷野猿公苑に到着しました。 猿たちが温泉に入らないで周りに座ったり歩いたりしています。たぶん猿はいつも温泉にいるから飽きているかもしれません。 数分後についに猿が一匹入りました。観光客はみんな喜んでいました。 その上に、下記の写真のとおりに二匹の猿がやりました。ブライによると、この写真は「完璧な写真」だそうです（笑） 地獄谷野猿公苑からホステルまでまた歩こうとしました。ラーメンがもう消化されたのでお腹すいていました。運良くカフェを見つけました。カフェの照明が冬の景色と美しい対照をなすと思って写真を取ってみました。 ホットチョコレートを注文しました。冬といえばホットココアですね? ( ꈍᴗꈍ) 飲んだから寒い雪の山道を乗り切れるようになります! 湯田中温泉: 泊まっているホステルがよろづやという温泉と提携しているのでお得な割引を提供してくれました。その切符を購入してよろづやに向かいました。ホステルから歩いて5分で超便利ですね。  よろづやの上品で伝統的なインテリアが気に入りました。  露天風呂に入って積もった雪を見ました。残念ながら雪が降らなかったけど、雪景色の中で入るお風呂は最高でした。ほぼ一日中使っていた足が温泉の熱さのおかげでリラックスできて回復されました。疲れた後の温泉は最高ですね〜 ブライはこのくらい温泉で幸せでした。 居酒屋で夕食: 温泉から出たのはもう遅いのでほぼすべてのレストランがもう閉店していました。結局まだ開いている居酒屋に食べに行きました。 ブライアンはアルコールアレルギーで、私もアルコールの頻度を減らしたいので二人は居酒屋でソフトドリンク飲んじゃいました。オレンジジューズとサイダーで乾杯したのは面白いと思います。 焼き鳥食べました〜しょっぱすぎてオレンジジューズを注文したのはありがたいです(笑) 焼きおにぎりを食べたことないので食べました。なぜ茶色かわからなくて玄米だと思っていて超ヘルシーな居酒屋メニューだと思いました。ブライがそれは玄米じゃなくて醤油の効果だよって説明してくれました。間違えましたね(；^ω^） 二日目奥志賀高原スキー場: 湯田中駅から奥志賀高原までこのお得な赤いチケットでバスを乗りました。 雪の山が綺麗ですね〜これは東京から全然見えない景色なんです。 着いたらリフトのチケットを購入してスキーレンタルしました。  リフト乗りました。天気がよくてありがたいですヽ(･ˇ∀ˇ･ゞ) スキースクール、クラスとか受けてないのでスキーのやり方があまりわかりません。他のスキーヤーを見習いながらやってみました。 すごく怯えていましたがやってみたかったです。リフトを降りたらスキーでしか坂を降りられません。その恐怖を少し忘れるようにイヤホンを使いました。陽気な音楽を聴いたらとても恐怖心は和らぎました。音楽に励まされていてわくわくしながら坂を滑り降りました。 一方で、よく自信がなくなりました。転ぶのが怖くてパニックに陥っていました。パニックだから体が硬くなっちゃって結局転んでしまいました。転びすぎて何回転んだかがもう数えられないほど多いです。 初級の坂なのにこれほどへたくそなのは恥ずかしいですね(^～^;)ゞでも大丈夫ですよー。だれでも最初は初心者だからこの経験は当然です。だって、スキーをした理由はエンジョイするためですから。 とにかくすごく楽しかったです。転んでも雪がすごく柔らかくて全然大丈夫でした。 でも、知らないこととか、あまりなれていないことをやれば、頭が疲れますね? 言いたいのはスキーで脳の細胞が死んだように精神的に疲れました(~_~メ) 渋温泉へ: さきのバスチケットは往復なのでそれを使ってバスで山を降りました。 夕食: バス停から少し歩いてハッピーレストランに着きました。 うわ～やっと本物の食べ物なんです（朝食はヨーグルト、ランチはカロリーメイトしか食べなかったもの）！とんかつ定食が結構美味しかったです。 金具屋: 帰り道に渋温泉の金具屋に見に行きました。金具屋は歴史の宿です。スタジオジブリの千と千尋の神隠しのモデルだそうです。 渋温泉から歩いて帰りました。雪がもう半解凍されていたのですごく滑りやすかったです。気を付けて歩きました。 途中で、この雪で覆われているポストを見ました。私は雪とポストが両方好きで一枚の写真でこの素敵なシーンが撮れるのがいいですね〜さらに真赤なポストは真っ白な雪との対比が綺麗ですね〜 三日目ホステルをチェックアウトして、湯田中駅に向かいました。電車で長野駅に向かいました。時間を潰したいため本を読みました。 着いたらちょうどランチタイムでした。ブライが信州そば食べたかったので駅の立ち食いそば屋さんで月見そばを食べました。立ち食いははじめてでした (人 •͈ᴗ•͈) 予約したバスの時間になったらバス停に向かいました。なぜ帰るのがバスかの理由は節約したいからですが、休みはリラックスする時間のはずだから、それほど安っぽくしたくないと二人と決めました。往路が新幹線で復路がバスは満足できる妥協だと思いました。 バスを乗って本を読み続けました。 その後は、最後にこのレポートを書き終わらせました。全体的に、それはとても素敵な休暇でした。 今回の旅行は、私が雪の上を歩いた中で最も長い時間だと思います。 フィリピン人として熱帯の国で育ち、雪が降るのを見たことがなかったので、長野のような雪の降る場所に行くととても幸せです。 校正者：田中大樹 "
        }
        
    
];

var idx = lunr(function () {
    this.ref('id')
    this.field('title')
    this.field('body')

    documents.forEach(function (doc) {
        this.add(doc)
    }, this)
});
function lunr_search(term) {
    document.getElementById('lunrsearchresults').innerHTML = '<ul></ul>';
    if(term) {
        document.getElementById('lunrsearchresults').innerHTML = "<p>Search results for '" + term + "'</p>" + document.getElementById('lunrsearchresults').innerHTML;
        //put results on the screen.
        var results = idx.search(term);
        if(results.length>0){
            //console.log(idx.search(term));
            //if results
            for (var i = 0; i < results.length; i++) {
                // more statements
                var ref = results[i]['ref'];
                var url = documents[ref]['url'];
                var title = documents[ref]['title'];
                var body = documents[ref]['body'].substring(0,160)+'...';
                document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML + "<li class='lunrsearchresult'><a href='" + url + "'><span class='title'>" + title + "</span><span class='body'>"+ body +"</span><span class='url'>"+ url +"</span></a></li>";
            }
        } else {
            document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = "<li class='lunrsearchresult'>No results found...</li>";
        }
    }
    return false;
}

function lunr_search(term) {
    $('#lunrsearchresults').show( 400 );
    $( "body" ).addClass( "modal-open" );
    
    document.getElementById('lunrsearchresults').innerHTML = '<div id="resultsmodal" class="modal fade show d-block"  tabindex="-1" role="dialog" aria-labelledby="resultsmodal"> <div class="modal-dialog shadow" role="document"> <div class="modal-content"> <div class="modal-header" id="modtit"> <button type="button" class="close" id="btnx" data-dismiss="modal" aria-label="Close"> &times; </button> </div> <div class="modal-body"> <ul class="mb-0"> </ul>    </div> <div class="modal-footer"><button id="btnx" type="button" class="btn btn-primary btn-sm" data-dismiss="modal">Close</button></div></div> </div></div>';
    if(term) {
        document.getElementById('modtit').innerHTML = "<h5 class='modal-title'>Search results for '" + term + "'</h5>" + document.getElementById('modtit').innerHTML;
        //put results on the screen.
        var results = idx.search(term);
        if(results.length>0){
            //console.log(idx.search(term));
            //if results
            for (var i = 0; i < results.length; i++) {
                // more statements
                var ref = results[i]['ref'];
                var url = documents[ref]['url'];
                var title = documents[ref]['title'];
                var body = documents[ref]['body'].substring(0,160)+'...';
                document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML + "<li class='lunrsearchresult'><a href='" + url + "'><span class='title'>" + title + "</span><small><span class='body'>"+ body +"</span><span class='url'>"+ url +"</span></small></a></li>";
            }
        } else {
            document.querySelectorAll('#lunrsearchresults ul')[0].innerHTML = "<li class='lunrsearchresult'>Sorry, no results found. Close & try a different search!</li>";
        }
    }
    return false;
}
    
$(function() {
    $("#lunrsearchresults").on('click', '#btnx', function () {
        $('#lunrsearchresults').hide( 5 );
        $( "body" ).removeClass( "modal-open" );
    });
});